## Staging: route53
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                   RESOURCE                    |
|--------|-----------------------------------------------|
| add    | `aws_route53_health_check.blawx_health_check` |
|        | `aws_route53_zone.blawx_hosted_zone`          |

| CHANGE |      OUTPUT       |
|--------|-------------------|
| add    | `domain_name`     |
|        | `health_check_id` |
|        | `hosted_zone_arn` |
|        | `hosted_zone_id`  |
|        | `name_servers`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_health_check.blawx_health_check will be created
  + resource "aws_route53_health_check" "blawx_health_check" {
      + arn               = (known after apply)
      + disabled          = false
      + enable_sni        = (known after apply)
      + failure_threshold = 3
      + fqdn              = "blawx.cdssandbox.xyz"
      + id                = (known after apply)
      + measure_latency   = false
      + port              = 443
      + request_interval  = 30
      + resource_path     = "/health"
      + tags              = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-health-check"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "blawx-staging"
          + "Name"       = "blawx-staging-health-check"
          + "Terraform"  = "true"
        }
      + triggers          = (known after apply)
      + type              = "HTTPS"
    }

  # aws_route53_zone.blawx_hosted_zone will be created
  + resource "aws_route53_zone" "blawx_hosted_zone" {
      + arn                 = (known after apply)
      + comment             = "Hosted zone for blawx staging environment"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "blawx.cdssandbox.xyz"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "CostCentre" = "blawx-staging"
          + "Domain"     = "blawx.cdssandbox.xyz"
          + "Name"       = "blawx-staging-hosted-zone"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "blawx-staging"
          + "Domain"     = "blawx.cdssandbox.xyz"
          + "Name"       = "blawx-staging-hosted-zone"
          + "Terraform"  = "true"
        }
      + zone_id             = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + domain_name     = "blawx.cdssandbox.xyz"
  + health_check_id = (known after apply)
  + hosted_zone_arn = (known after apply)
  + hosted_zone_id  = (known after apply)
  + name_servers    = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
